# RbsConnectorIsprimary Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsConnectorIsprimary Property
ParameterTypeId Class See Also
---
"Primary Connector"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsConnectorIsprimary { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsConnectorIsprimary As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsConnectorIsprimary {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace